[BreakthroughLightArmorHealth X2TechTemplate]
DisplayName="加强型轻型装甲"
Summary="在我们的轻型装甲开发中，以前未实现的突破将使我们的最轻型型号能够在未来提供+1的装甲。"

[BreakthroughHeavyArmorHealth X2TechTemplate]
DisplayName="加强重型装甲"
Summary="我们的研究突破产生了一种新的方法，可以在不增加重量的情况下增强我们重型装甲的耐久性，从而增加+1点装甲。"

[BreakthroughMediumArmorHealth X2TechTemplate]
DisplayName="强化中型装甲"
Summary="在我们的中型装甲开发中，一个以前未实现的突破将使我们的标准型号能够在未来提供+1的装甲。"

[BreakthroughSparkArmorHealth X2TechTemplate]
DisplayName="加强型机器人装甲"
Summary="我们的研究突破产生了一种新的方法，可以在不增加重量的情况下增强我们的机器人装甲的耐久性，从而增加 +1 装甲。"

[BreakthroughReaperArmorHealth X2TechTemplate]
DisplayName="强化死神装甲"
Summary="我们的死神装甲开发中以前未实现的突破将为死神提供 +1 装甲。"

[BreakthroughSkirmisherArmorHealth X2TechTemplate]
DisplayName="强化散兵装甲"
Summary="在我们的散兵护甲开发中，一个以前未实现的突破将为散兵提供+1的护甲。"

[BreakthroughTemplarArmorHealth X2TechTemplate]
DisplayName="强化圣殿骑士盔甲"
Summary="我们在圣殿骑士盔甲开发中之前未实现的突破将为圣殿骑士提供+1的装甲。"

[BreakthroughConventionalArmorHealth X2TechTemplate]
DisplayName="强化常规装甲"
Summary="在我们的中型装甲开发中，以前未实现的突破将使我们的传统变体能够在未来提供+1的装甲。"

[BreakthroughPlatedArmorHealth X2TechTemplate]
DisplayName="加固镀层装甲"
Summary="在我们的镀层装甲开发中，一个以前未实现的突破将使我们的镀层变体能够在未来提供+1的装甲。"

[BreakthroughPoweredArmorHealth X2TechTemplate]
DisplayName="加强动力装甲"
Summary="在我们的动力装甲开发中，一个以前未实现的突破将使我们的动力变体能够在未来提供+1的装甲。"